<HTML>
<HEAD>
<TITLE>Chapter VI ADH&Acirc;N AND IQ&Acirc;MAH</TITLE>
</HEAD>
<BODY>
<CENTER>
<A HREF="../../index.htm">Sacred Texts</A>&nbsp;
<A HREF="../index.htm">Islam</A>&nbsp;
<A HREF="index.htm">Index</A>&nbsp;
<A HREF="had08.htm">Previous</A>&nbsp;
<A HREF="had10.htm">Next</A>&nbsp;
</CENTER>
<HR>
<H1 ALIGN="CENTER">CHAPTER VI</H1>
<H3 ALIGN="CENTER">ADH&Acirc;N AND IQ&Acirc;MAH</H3><DIR>
<DIR>

<P>1. "O you who believe! When the call is given out for prayer on Friday, hasten to the remembrance of All&acirc;h and leave off business." (62:9).</P></DIR>
</DIR>

<P>The <I>adh&acirc;n</I> (lit. an announcement) is an announcement of the time of prayer in the words of h. 3, on hearing which Muslims flock to the mosque or to a place of prayer. and the <I>iq&acirc;mah</I> (lit. <I>setting upright of a thing</I> or <I>establishing an affair</I>) is a similar call in the words of h. 4, at which those gathered in the mosque arrange themselves into ranks and the prayer service is started. Though prayers were said in congregation from the very start when this institution was established very early at Makkah the <I>adh&acirc;n</I> and the <I>iq&acirc;mah</I> were introduced after the flight to Mad&icirc;nah. But the <I>adh&acirc;n</I> is not only an announcement to the people to gather together for prayer; it is as well a declaration of the principles of Isl&acirc;m, made with a loud voice, from every locality inhabited by Muslims. It is an announcement to the whole world five times a day as to what Isl&acirc;m is and what it stands for. In the <I>shah&acirc;dah</I> there is a declaration of the basic principles of Isl&acirc;m that there is no god but All&acirc;h--God is only One--and that Muhammad is the Messenger of All&acirc;h. In the <I>takb&icirc;r</I> there is the declaration that All&acirc;h is the greatest of all and that, therefore a Muslim bows before none but Allah--<I>All&acirc;hu Akbar</I> the watchword of Isl&acirc;m is repeated no less than six times in the <I>adh&acirc;n</I>. In <I>hayya 'ala-l-sal&acirc;</I> (come to prayer) there is the declaration of the real message of religion which is the realization of the divine in man. This can only be attained through prayer, by drinking deep at the Divine source. In <I>hayya 'ala-l-fal&acirc;h</I> (come to success) we are told that success or full development of the human faculties, can be attained only through prayer or the realization of the divine in man.</P>
<P>The adh&acirc;n thus serves a double purpose; it is an announcement of the time of prayer and at the same time an announcement of the principles of Isl&acirc;m and the significance underlying them. It replaces the meaningless ringing of a bell or the blowing of a trumpet by the most effective propaganda of religion that can be thought of. To everyone's door, nay, to his very ears. is carried the message every morning, every noon, every afternoon, every evening and at the time of going to bed that the Unity of God and the messengership of Muhammad, peace</P>
<P>{p. 90}</P>
<P>and blessings of All&acirc;h be on him, are the fundamental principles Isl&acirc;m, and that any one can attain to complete self-development through the realization of the divine in him, which is brought about by prayer.</P>
<P>Muslims must give up all business on hearing the call for prayer (v. 1). How adh&acirc;n was started is stated in hh. 1, 2, while h. 3 gives the words of the adh&acirc;n and h. 4 the words of the iq&acirc;mah. Hh. 5-8 relate to the mode of delivery of the adh&acirc;n, while hh. 9, 10 show that the adh&acirc;n must be delivered from a high place and in the loudest voice so that it may reach the largest number of people, The deliverer of the adh&acirc;n must be a man who is respected for his virtues and he should take no remuneration for this service (hh. 11, 12). The call must be obeyed (h. 13). The words of the adh&acirc;n should be repeated when it is being delivered, and a prayer must be offered after it has been delivered (hh. 14-16). The adh&acirc;n may be called out earlier than the time of prayer if there is some other object in view (h. 17). Hh. 18. 19 relate to the delivery of the iq&acirc;mah.</P>
<P><B><FONT SIZE=5 COLOR=GREEN>1</FONT></B> It is reported about Ibn 'Umar that he used to say,</P>
<P>The Muslims when they came to Mad&icirc;nah used to gather together and they made an appointment for prayers; no call was given for it. So they talked about it one day. Some of them said, Have a bell like the bell of the Christians; others said, Rather a bugle like the horn of the Jews; 'Umar said, Would</P>
<P>{p. 92}</P>
<P>you not appoint a man who should sound a call for the prayer.[1] The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said, "O Bil&acirc;l! get up and give a call for prayer."</P>
<P ALIGN="RIGHT">(B. 10:1.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>2</FONT></B> Anas said,</P>
<P>When the number of people increased, they conversed that they should make known the time of prayers by some means which they may recognize. So they mentioned that they should light the fire or</P>
<FONT SIZE=2><P>[1. It appears from other had&icirc;th that the portion that follows relates to another occasion. A consultation was held but nothing was decided then, though 'Umar seems to have made a suggestion that, instead of ringing a bell or blowing a horn, a man should be appointed to give a call for prayers. According to one had&icirc;th 'Abd All&acirc;h ibn Zaid was shown in a vision how to give a call for prayer. So when the Messenger of All&acirc;h came the next day, he informed him: O Messenger of All&acirc;h! I was half asleep and half awake when there came to me one who showed me how to deliver the adh&acirc;n. The narrator of the Had&icirc;th added, 'Umar had been shown it twenty days previously but concealed it, then he informed the Holy Prophet (AD. 2:27). Bukh&acirc;r&icirc; refers to this by quoting 'Umar as saying, Would you not appoint a man who should give a call for prayer. It was, however, the Holy Prophet's order--or maybe, he himself had received a revelation, similar to the visions of 'Abd All&acirc;h and 'Umar as some reports show--which gave the sanction to the adh&acirc;n.]</P>
</FONT><P>{p. 92}</P>
<P>ring a bell. Then Bil&acirc;l was commanded to callout the adh&acirc;n, repeating the words, and to say the iq&acirc;mah, uttering the words only once.</P>
<P ALIGN="RIGHT">(B. 10:2.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>3</FONT></B> Ab&ucirc; Mabdh&ucirc;rah said,</P>
<P>I said, O Messenger of All&acirc;h! Teach me the way of delivering the adh&acirc;n. He said, So he touched his forehead (and) said:</P>
<P>"Thou shouldst say:</P>
<P>'All&acirc;h is the Greatest, All&acirc;h is the Greatest, All&acirc;h is the Greatest, All&acirc;h is the Greatest.'</P>
<P>Thou shouldst raise thy voice with it; then thou shouldst say,</P>
<P>'I bear witness that there is no God but All&acirc;h, I bear witness that there is no God but All&acirc;h, I bear witness that Muhammad is the Messenger of All&acirc;h, I bear witness that Muhammad is the Messenger of All&acirc;h.'</P>
<P>Thou shouldst lower</P>
<P>{p. 93}</P>
<P>thy voice with it; then thou shouldst raise thy voice with the bearing of witness,</P>
<P>'I bear witness that there is no God but All&acirc;h, I bear witness that there is no God but All&acirc;h, I bear witness that Muhammad is the Messenger of All&acirc;h, I bear witness that Muhammad is the Messenger of All&acirc;h. Come to prayer, Come to prayer; Come to success, Come to success'.</P>
<P>Then if it is the morning prayer, thou shouldst say, 'Prayer is better than sleep' 'Prayer is better than sleep';</P>
<P>(Then thou shouldst say),</P>
<P>'All&acirc;h is the Greatest, All&acirc;h is the Greatest, there is no God but All&acirc;h.'"[2]</P>
<P ALIGN="RIGHT">(AD-Msh. 4:4.)</P>
<FONT SIZE=2><P>[2. The repetition of the <I>shah&acirc;dah</I> a second time as stated in this had&icirc;th is known as <I>tarj&icirc;'</I> (lit. returning to a thing again and again). As the previous had&icirc;th and the one that follows show, the general practice in the Holy Prophet's time was that the adh&acirc;n consisted of fifteen sentences, <I>All&acirc;hu-Akbar</I> four times, <I>ashhadu an l&acirc; il&acirc;ha illa-ll&acirc;h</I> twice, <I>ashhadu anna Muhammadan Ras&ucirc;lu-ll&acirc;h</I> twice (both sentences beginning with <I>ashhadu</I> are known as the <I>shah&acirc;dah</I>) <I>hayya 'ala-l-sal&acirc;</I> (pronounced <I>'ala-s-sal&acirc;</I>) twice (turning the face to the right), <I>hayya 'ala-l-fal&acirc;h</I> twice (turning the face to the left), <I>All&acirc;hu Akbar</I> twice and <I>l&acirc; il&acirc;ha illa-ll&acirc;h</I> once. The <I>tarji'</I> or repeating the two <I>shah&acirc;dah</I> sentences twice again in a still louder voice seems to have been resorted to only occasionally. In the adh&acirc;n for the morning prayer the sentence <I>al-sal&acirc;tu</I> (pronounced <I>as-sal&acirc;t</I>) <I>khair-un mina-l-naum</I> (pronounced <I>mina-n-naum</I>) was added after <I>hayya 'ala-l-fal&acirc;h</I>, and repeated twice.]</P>
</FONT><P>{p. 94}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>4</FONT></B> Ibn 'Umar said,</P>
<P>In the time of the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, (sentences of) the adh&acirc;n used to be repeated twice, and (those of) the iq&acirc;mah (were uttered) only once, with this exception that he used to say, Prayer is ready, Prayer is ready.[3]</P>
<P ALIGN="RIGHT">(AD-Msh. 4:4.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>5</FONT></B> Sa'd reported that</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, commanded</P>
<FONT SIZE=2><P>[3. As compared with the adh&acirc;n, the sentences were uttered only once in the iq&acirc;mah, according to this Had&icirc;th. the significance being that sentences that were uttered twice in the adh&acirc;n were uttered once in the iq&acirc;mah. The iq&acirc;mah thus consists of <I>All&acirc;hu Akbar</I> being uttered twice--in the adh&acirc;n it is uttered four times--each of the shah&acirc;dah sentences once, <I>hayya 'ala-l-sal&acirc;</I> and <I>hayy'ala-l-fal&acirc;h</I> each once (without turning to right or left), <I>qad q&acirc;mati-l-sal&acirc;</I> twice, <I>All&acirc;hu Akbar</I> and <I>l&acirc; il&acirc;ha illa-ll&acirc;h</I> once.</P>
<P>But the iq&acirc;mah may also consist of all the sentences of the adh&acirc;n with the addition in its proper place of <I>qad q&acirc;mati-l-sal&acirc;</I> uttered twice. Between the delivery of the adh&acirc;n and the iq&acirc;mah there is another difference. The sentences of the adh&acirc;n are delivered leisurely and in as loud a voice as possible, while the delivery of the iq&acirc;mah is marked by quickness.]</P>
</FONT><P>{p. 95}</P>
<P>Bil&acirc;l to put his two forefingers into his ears (when delivering the adh&acirc;n); this, he said, would help in the raising of thy voice.</P>
<P ALIGN="RIGHT">(IM-Msh. 4:4.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>6</FONT></B> It is related about Bil&acirc;l that he put his two forefingers into his ears (when delivering the adh&acirc;n), while Ibn 'Umar did not put his fore-fingers into his ears;[4] and Ibr&acirc;h&icirc;m said, There is no harm in delivering the adh&acirc;n without performing ablution; and 'At&acirc;' said, Ablution is necessary and it is the (Prophet's) practice.</P>
<P ALIGN="RIGHT">(B. 10:19.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>7</FONT></B> Ab&ucirc; Juhaifah said,</P>
<P>That he saw Bil&acirc;l delivering the adh&acirc;n. (He said), So I followed him when he turned his face to one side and to the other in the adh&acirc;n.</P>
<P ALIGN="RIGHT">(B. 10:19.)</P>
<FONT SIZE=2><P>[4. Fore-fingers are not put into ears in the iq&acirc;mah.]</P>
</FONT><P>{p. 96}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>8</FONT></B> M&ucirc;s&acirc; said,</P>
<P>I saw Bil&acirc;l (when) he went forth to the Abtah and delivered the adh&acirc;n, so when he reached <I>hayya 'ala-l-sal&acirc;, hayya 'ala-fal&acirc;h</I>, he turned his neck to the right side and to the left and did not turn round.[5]</P>
<P ALIGN="RIGHT">(AD. 12:34.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>9</FONT></B> A woman of the Ban&icirc; Najj&acirc;r said,</P>
<P>My house was the highest house in the environs of the mosque and Bil&acirc;l used to deliver the morning adh&acirc;n on it.[6]</P>
<P ALIGN="RIGHT">(AD. 2:31)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>10</FONT></B> 'Abd All&acirc;h reported ... that</P>
<P>Abu Sa'&icirc;d Khudr&icirc; said to him, I see thee living</P>
<FONT SIZE=2><P>[5. With <I>hayya 'ala-l-sal&acirc;</I>, the mu'adhdhin turns his face to the right side and with <I>hayya 'ala-l-fal&acirc;h</I> to the left.</P>
<P>6. A high place, the top of a house or a minaret, would carry the voice farthest.]</P>
</FONT><P>{p. 97}</P>
<P>among goats and in the desert, so when thou are among thy goats or in thy desert and deliverest the adh&acirc;n for prayer, raise thy voice with the adh&acirc;n, for neither jinn nor man nor anything else hears the voice of the crier within its reach but it shall bear witness for him on the day of Resurrection.[7]</P>
<P ALIGN="RIGHT">(B. 10:5.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>11</FONT></B> Ab&ucirc; Hurairah said, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"The Im&acirc;m is a surety and the deliverer of the adh&acirc;n is one in whom confidence is placed;[8] O All&acirc;h! direct aright the leaders of prayer and grant protection to the deliverers of the adh&acirc;n."</P>
<P ALIGN="RIGHT">(AD. 2:32)</P>
<FONT SIZE=2><P>[7. The voice in delivering the adh&acirc;n should be raised as high as possible.</P>
<P>8. The had&icirc;th speaks of the im&acirc;m as <I>dz&acirc;min</I>, being as it were a surety that prayers are observed in the right manner; and it speaks of the mu'adhdhin (one {footnote p. 98} who delivers the adh&acirc;n) as <I>mu'taman</I>, <I>i.e.</I>, one in whom trust is placed, which indicates on the one hand that he is the keeper of the time of prayer and on the other that he must be a man who is respected on account of his high qualities.]</P>
</FONT><P>{p. 98}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>12</FONT></B> Uthm&acirc;n ibn Abi-l-'&Acirc;s said,</P>
<P>O Messenger of All&acirc;h! Make me the im&acirc;m of a people. He said:</P>
<P>"Thou art their im&acirc;m and do thou follow the weakest of them[9] and appoint a mu'adhdhin who does not take any remuneration for his adh&acirc;n."[10]</P>
<P ALIGN="RIGHT">(AD. 2:39.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>13</FONT></B> Abu Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, commanded us (saying):</P>
<P>"When you are in the mosque and a call for prayers is sounded, let not one of you go out until he has said his prayers."</P>
<P ALIGN="RIGHT">(Ah-Msh. 4:23.)</P>
<FONT SIZE=2><P>[9. The im&acirc;m should have regard for the weakest and make his prayer so light that the weakest man may not feel it a burden.</P>
<P>10. Isl&acirc;m thus requires that a duty which relates to the prayers should be performed out of love.]</P>
</FONT><P>{p. 99}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>14</FONT></B> Ab&ucirc; Sa'&icirc;d Khudr&icirc; reported that</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"When you hear the adh&acirc;n, say what the mu'dhdhin says."</P>
<P ALIGN="RIGHT">(B. 10:7)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>15</FONT></B> Yahy&acirc; said,</P>
<P>Some of our brethren related to me that when he (Mu'&acirc;wiyah) heard the words, Come to prayer, he said, There is no strength nor power but in All&acirc;h, and he said, Thus did we hear your Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, say.[11]</P>
<P ALIGN="RIGHT">(B. 10:7.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>16</FONT></B> J&acirc;bir reported that The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<FONT SIZE=2><P>[11. Hayya 'ala-l-sal&acirc; being an order, the proper response to it is that given in this had&icirc;th, When the adh&acirc;n is being delivered, the hearer should repeat its sentences and when it is finished, be should offer the prayer mentioned in the next had&icirc;th.]</P>
</FONT><P>{p. 100}</P>
<P>"Whoever says when he hears the adh&acirc;n,</P>
<P>'O All&acirc;h! the Lord of this perfect call and everliving prayer, grant to Muhammad nearness and excellence and raise him to the position of glory which Thou hast promised him,'</P>
<P>My intercession will be due to him on the day of Resurrection."</P>
<P ALIGN="RIGHT">(B. 10:8.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>17</FONT></B> 'Abd All&acirc;h reported on the authority of the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, (who) said:</P>
<P>"Let not the adh&acirc;n of Bil&acirc;l prevent one of you from taking his breakfast,[12] for he delivers the adh&acirc;n while it is night, so that he may send back the one of you who is saying his</P>
<FONT SIZE=2><P>[12. "Breakfast" here means the meal taken before dawn when a man intends to fast. The had&icirc;th thus allows the calling out of the adh&acirc;n before the time of prayer. By prayer in the concluding portion is meant the tahajjud prayer.]</P>
</FONT><P>{p 101}</P>
<P>prayer or awaken the one who is sleeping."</P>
<P ALIGN="RIGHT">(B. 10:13.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>18</FONT></B> Abd All&acirc;h reported that The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Between every two adh&acirc;ns, there is a prayer for him who likes."[12] (He said this) thrice.</P>
<P ALIGN="RIGHT">(B. 10:14.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>19</FONT></B> Ziy&acirc;d said that</P>
<P>He delivered the adh&acirc;n, and Bil&acirc;l desired to call out the iq&acirc;mah but the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"O brother of <I>Sud&acirc;'</I>! The one who calls out the adh&acirc;n shall call out the iq&acirc;mah.",[14]</P>
<P ALIGN="RIGHT">(Ah. IV, 169.)</P>
<FONT SIZE=2><P>[13. By the two adh&acirc;ns are meant the adh&acirc;n and the iq&acirc;mah. The interval between the two should be at least such that a man may be- able to say two rak'ahs of optional prayer. Another had&icirc;th says that there should be an interval such that a man taking his food may finish it, say, about a quarter of an hour.</P>
<P>14. There may be exceptions to this general rule. <I>Sud&acirc;'</I> is the name of a tribe in Yaman and Ziy&acirc;d was a member of this tribe.]</P>
</FONT><P>{p. 102}</P>
<HR>
<CENTER>
<A HREF="had10.htm">Next: Chapter VII THE IM&Acirc;M</A></CENTER>
</BODY>
</HTML>
