<HTML>
<HEAD>
<TITLE>Chapter XIV MISCELLANEOUS PRAYERS</TITLE>
</HEAD>
<BODY>
<CENTER>
<A HREF="../../index.htm">Sacred Texts</A>&nbsp;
<A HREF="../index.htm">Islam</A>&nbsp;
<A HREF="index.htm">Index</A>&nbsp;
<A HREF="had16.htm">Previous</A>&nbsp;
<A HREF="had18.htm">Next</A>&nbsp;
</CENTER>
<HR>
<H1 ALIGN="CENTER">CHAPTER XIV</H1>
<H3 ALIGN="CENTER">MISCELLANEOUS PRAYERS</H3>
<H3 ALIGN="CENTER">(ISTIKH&Acirc;RAH. SAL&Acirc;T AL-KUS&Ucirc;F, ISTISQ&Acirc;')</H3>
<I><P>Istikh&acirc;rah (lit. the asking of khair, i.e., good or blessing) means the asking of Divine blessing in the doing of a thing which a man intends to do. Kus&ucirc;f means the eclipse of the sun or the moon. Istisq&acirc;' (from saqy, giving to drink) is a prayer for rain.</P>
</I><P><B><FONT SIZE=5 COLOR=GREEN>1</FONT></B> J&acirc;bir said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to teach us istikh&acirc;rah in all matters, as he used to teach us a chapter of the Qur'&acirc;n. He said:</P>
<P>"When one of you intends the doing of a thing, he should say two rak'ahs[1] besides the obligatory prayers, then he should pray--'O All&acirc;h! I desire Thy blessing by Thy knowledge, and I beg of Thee to give</P>
<FONT SIZE=2><P>[1. The best time for istikh&acirc;rah is after the 'Ish&acirc;' prayer.]</P>
</FONT><P>{p. 185}</P>
<P>me power (to do it) by Thy power, and I ask of Thee Thy great grace, for Thou hast the power while I have not the power, and Thou knowest while I do not know, and Thou art the Great Knower of the unseen things. O All&acirc;h! If Thou knowest that this affair is good for me in the matter of my religion and my living and the result of my affair--or he said, in the present state of my affair and in its future--then ordain it for me and make it easy for me and bless (me) therein; and if Thou knowest that this affair is evil for me in the matter of my religion and my living and the result of my affair--or he said, in the present state of my affair and in its future--then turn it away from me and turn me away from it and ordain what is good</P>
<P>{p. 286}</P>
<P>for me wheresoever it is, and make me contented with it.'</P>
<P>He (the Prophet) said,</P>
<P>"And he should say what he wants."[2]</P>
<P ALIGN="RIGHT">(B. 19:25.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>2</FONT></B> Abd All&acirc;h ibn 'Amr said 'When the sun was eclipsed in the time of the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, a call was given that prayer-service gathering together (people) was going to be held.</P>
<P ALIGN="RIGHT">(B. 16:3.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>3</FONT></B> '&Acirc;'ishah said,</P>
<P>'The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, recited aloud his <I>qir&acirc;'at</I> in the eclipse prayer and when he finished his recital he pronounced the takb&icirc;r and performed the ruk&ucirc;'; and when he raised (his head) from the ruk&ucirc;', he said, "All&acirc;h listens to him who praises Him. Our</P>
<FONT SIZE=2><P>[2. <I>Istikh&acirc;rah</I> is an individual prayer. and it may be continued for several days until the mind through Divine help is settled on an affair. It is not necessary that a man should be informed in a vision as to the course which he should adopt.]</P>
</FONT><P>{p. 187}</P>
<P>Lord! And Thine is the praise." Then he returned to the recital (of the Qur'&acirc;n). In the eclipse prayer there are four ruk&ucirc;'s and four sajdahs in two rak'ahs.[3]</P>
<P ALIGN="RIGHT">(B. 16:19.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>4</FONT></B> Abd All&acirc;h reported,</P>
<P>I saw the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, on the day he went out to pray for rain. He said, He (the Prophet) turned his back to the people and faced the Qiblah praying, then he turned over his outer wrapping garment, then he said with us two rak'ahs of prayer reciting therein the qir&acirc;'at aloud.[4]</P>
<P ALIGN="RIGHT">(B. 15:17.)</P>
<FONT SIZE=2><P>[3. The eclipse prayer is a congregational service in which both men and women take part (B. 16:10). The particular eclipse which is spoken of in this had&icirc;th occurred on the very day on which Ibr&acirc;h&icirc;m, the Holy Prophet's eighteen months old son, died (B. 16:17).</P>
<P>4. This was a special service for rain held in an open place. Prayer may also be offered for rain without holding a special service (H xi. 13, B. 11:35).]</P>
</FONT><P>{p. 188}</P>
<HR>
<CENTER>
<A HREF="had18.htm">Next: Chapter XV BURIAL SERVICE</A></CENTER>
</BODY>
</HTML>
