<HTML>
<HEAD>
<TITLE>Chapter XV BURIAL SERVICE</TITLE>
</HEAD>
<BODY>
<CENTER>
<A HREF="../../index.htm">Sacred Texts</A>&nbsp;
<A HREF="../index.htm">Islam</A>&nbsp;
<A HREF="index.htm">Index</A>&nbsp;
<A HREF="had17.htm">Previous</A>&nbsp;
<A HREF="had19.htm">Next</A>&nbsp;
</CENTER>
<HR>
<H1 ALIGN="CENTER">CHAPTER XV</H1>
<H3 ALIGN="CENTER">BURIAL SERVICE</H3><DIR>
<DIR>

<P>1. "And give good news to the patient ones who, when a misfortune befalls them. say: We are All&acirc;h's and to Him shall we return. These are they on whom are blessings and mercy from their Lord. and these are the followers of the right course" (2:155-157).</P>
<P>2. "Our Lord! Forgive us and those of our brethren who had precedence of us in faith" (59:10).</P>
<P>3. "And never hold a burial service for any one of them who dies and do not stand (to pray) on his grave: surely they disbelieve in All&acirc;h and his Messenger" (9:84).</P></DIR>
</DIR>

<P>When news of death is received, one should repeat the words <I>inn&acirc; li-ll&acirc;h-i wa inn&acirc; ilai-hi r&acirc;ji'&ucirc;n</I> (v. 1). The asking of forgiveness for the departed ones is a Muslim's duty towards a Muslim (v. 2), and this is done by the holding of a burial service at death. Burial service is prohibited in the case of those who disbelieve in All&acirc;h and His Messenger (v. 3), the particular people referred to in the verse being hypocrites whose disbelief had become manifest.</P>
<P>Details as to the duties of the living towards the dying and the dead are given in Had&icirc;th. Visiting the sick is a duty laid upon every Muslim (h. 11). When signs of the approach of death are witnessed in a person, the Holy' Qur'&acirc;n may be recited by his bedside (h. 1). Speaking well of the dead or a sick person when a visit is paid to him is recommended (h. 2). Grief for the dying or the dead is but natural. and one may weep when overcome (hh. 3. 4). but wailing, slapping the cheeks, tearing garments, etc., are forbidden (hh. 5, 6). Death of children is spoken of as a blessing in disguise (h. 7). The dead body must be washed and cleaned of all impurities and then wrapped up in clean cloth (hh. 8, 9). Following the bier is an act of great merit (h. 10), and a duty which a Muslim owes to his dead brother (h. 11). Respect must be shown to the bier, whether it be of a Muslim or of a non-Muslim (hh. 12, 13). A burial service may be held even in the absence of the dead body (h. 14). Women were advised not to follow a bier but there is no prohibition against it (h. 15). The bier may be followed on foot or riding (h. 16). Those who follow the bier arrange themselves into ranks behind the im&acirc;m at the burial service (h. 17).</P>
<P>{p. 189}</P>
<P>The service consists of four takb&icirc;rs and tasl&icirc;m while standing, there being no ruk&ucirc;' or sajdah but wudz&ucirc;' must be performed before joining it (bb. 17, 18). The bier is placed before the im&acirc;m who stands opposite the middle. or the breast, of the dead body (b. 19). The first takb&icirc;r is followed by the recital of the <I>F&acirc;tihah</I> in a soft voice audible to oneself (preceded by the <I>istift&acirc;h</I>, as in prayer); the second by the recital of <I>al sal&acirc;t 'ala-l-Nab&icirc;</I>; the third by an intercessory prayer for the dead one in particular, but it includes the living as well; and the fourth by tasl&icirc;m (hh. 20-23). Burial service must be held even on a Muslim who is guilty of heinous sins (H. viii:6). The committing of suicide is, according to Isl&acirc;m. a criminal act. but even such a person may not be deprived of the burial service (h. 24). In the battle-field the washing, the shrouding and the burial service were dispensed with, and two men were buried in one grave (h. 25). What should be said and done at the burial is related in (hh. 26, 27). The tomb should be raised a little above the ground and should be gibbous in shape (h. 28). The plastering of tombs or construction of buildings on them is discouraged (h. 29). The gathering of friends and relatives to console the bereaved family is allowed. and so also is the preparation for them of food, at which only those very nearly related should be present (hh. 30, 31). Abusing the dead is forbidden (h. 32). Charity on behalf of the dead is allowed (hh. 33, 34). When visiting graves, one must pray for the dead (h. 35).</P>
<P><B><FONT SIZE=5 COLOR=GREEN>1</FONT></B> Ma'qil said, of</P>
<P>The Messenger All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>Recite the <I>S&ucirc;rah Y&acirc;s&icirc;n</I> before the dying among you."[1]</P>
<P ALIGN="RIGHT">(Ah-Msh. 5:3.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>2</FONT></B> Umm Salamah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"When you visit a sick</P>
<FONT SIZE=2><P>[1. This chapter is full of expressions of Divine greatness and glory.]</P>
</FONT><P>{p. 190}</P>
<P>person or a dead one, speak well (of him), for the angels say &acirc;m&icirc;na to what you say."</P>
<P ALIGN="RIGHT">(M-Msh. 5:3.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>3</FONT></B> '&Acirc;'ishah said,</P>
<P>'The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, kissed 'Uthm&acirc;n ibn Maz'&ucirc;n while he was dead, and he wept, so that the tears of the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, flowed over the face of 'Uthm&acirc;n.[2]</P>
<P ALIGN="RIGHT">(M-Msh. 5:3.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>4</FONT></B> Anas said,</P>
<P>Along with the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, we visited Ab&ucirc; Saif, the blacksmith, and he was Ibr&acirc;h&icirc;m's foster-father.</P>
<FONT SIZE=2><P>[2. 'Uthm&acirc;n ibn Maz'&ucirc;n was the first person to die from among those who had fled from Makkah to Mad&icirc;nah for the sake of their faith in All&acirc;h.]</P>
</FONT><P>{p. 191}</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, took Ibr&acirc;h&icirc;m (in his arms) and kissed him and smelt him. Then we visited him after this while Ibr&acirc;h&icirc;m was yielding up his spirit; so tears began to flow from the eyes of the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, 'Abd al-Rahm&acirc;n ibn 'Auf said to him, And thou too, O Messenger of All&acirc;h? He said, "O Ibn 'Auf! That is compassion." Then he wept again and said:</P>
<P>"Surely the eye sheds tears and the heart grieves and we do not say but what the Lord is pleased with; and we, O Ibr&acirc;h&icirc;m! are full of grief on account of thy separation."[3]</P>
<P ALIGN="RIGHT">(B. 23:41)</P>
<FONT SIZE=2><P>[3. Ibr&acirc;h&icirc;m was the Holy Prophet's son by his Coptic wife, Mary. He died when he was eighteen months old. The words uttered by the Holy Prophet on this occasion will serve as a beacon to the world in its tragedies. Abu Saif's wife was wet-nurse to the Holy Prophet's son.]</P>
</FONT><P>{p. 192}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>5</FONT></B> 'Abd All&acirc;h said,</P>
<P>'The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"He is not of us who slaps the cheeks and tears the garments and mourns like the mourning of the (days of) Ignorance."</P>
<P ALIGN="RIGHT">(B. 23:35.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>6</FONT></B> 'Umar said,</P>
<P>'Leave them (the women) alone, weeping over Abu Sulaim&acirc;n, so long as there is not throwing of dust on heads or wailing.[4]</P>
<P ALIGN="RIGHT">(B. 23:33.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>7</FONT></B> Anas said, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"There is, from among the people, no Muslim who has three of his (children) dead before they have reached majority</P>
<FONT SIZE=2><P>[4. A Muslim must bear the calamity of the death of a friend or a relative patiently. Weeping is but a sign of tenderness and compassion in the human heart, but wailing and other manifestations which are not consistent with patience are forbidden.]</P>
</FONT><P>{p. 293}</P>
<P>but All&acirc;h will make him enter paradise by His gracious mercy on their account."</P>
<P ALIGN="RIGHT">(B. 23:6.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>8</FONT></B> Umm 'Atiyyah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, came to us while we were washing (the body of) his daughter; so he said:</P>
<P>"Wash her thrice or five times or more than that with water having (leaves of) the lote tree ( boiled in it), and the last time put in camphor; and when you have finished, inform me."</P>
<P>So when we had finished we informed him, and he threw towards us his waist-wrapper and said "Put it next to her body."</P>
<P ALIGN="RIGHT">(B. 23:9.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>9</FONT></B> '&Acirc;'ishah reported,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, was shrouded</P>
<P>{p. 194}</P>
<P>in three pieces of white washed cotton cloth,[5] made in Yaman; there was neither shirt in them nor turban.</P>
<P ALIGN="RIGHT">(B. 23:18.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>10</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Whoever stays with a bier until he joins the burial service over it, he has one portion; and whoever remains present till the body is buried, he has two portions."</P>
<P ALIGN="RIGHT">(B. 23:58.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>11</FONT></B> Bar&acirc; ibn '&Acirc;zib said,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, commanded us....to follow biers (to their last resting-place), to visit the</P>
<FONT SIZE=2><P>[5. <I>Sah&ucirc;liyyah</I> were so called in relation to Sah&ucirc;l, a place in Yaman, where they were woven or whence they were brought; or they were garments beaten and washed and whitened, so called in relation to <I>sah&ucirc;l</I> meaning one <I>who beats and washes and whitens clothes</I>. (LL).]</P>
</FONT><P>{p. 195}</P>
<P>sick person, to accept (the invitation of) one who invites (to a dinner), to help the oppressed one, to execute the oath, to return the salutation, and to utter a prayer for the sneezer.[6]</P>
<P ALIGN="RIGHT">(B. 23:2.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>12</FONT></B> '&Acirc;mir reported,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"When one of you sees a bier then, if he does not accompany it, he should stand until he leaves the bier behind or the bier leaves him behind, or it is put down before it leaves him behind."</P>
<P ALIGN="RIGHT">(B. 23:47.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>13</FONT></B> J&acirc;bir said,</P>
<P>A bier passed by us and the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, stood up for it, and we (also) stood up. Then we said, O Messenger of</P>
<FONT SIZE=2><P>[6. Only the first two commandments relate to this chapter, following a bier and visiting a sick person.]</P>
</FONT><P>{p. 196}</P>
<P>All&acirc;h! it is the bier of a Jew. He said:</P>
<P>"When you see a bier, stand up."[7]</P>
<P ALIGN="RIGHT">(B. 23:49.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>14</FONT></B> Ab&ucirc; Hurairah reported, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, gave the news of the death of the Negus on the day on which he died. He went forth to the place of prayer and made the people stand in ranks and uttered four takb&icirc;rs.[8]</P>
<P ALIGN="RIGHT">(B. 23:4)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>15</FONT></B> Umm 'Atiyyah said,</P>
<P>We were forbidden to follow biers, and it was not a decisive prohibition.[9]</P>
<P ALIGN="RIGHT">(B. 23:29)</P>
<FONT SIZE=2><P>[7. Equal respect must be shown to a bier whether it is that of a Muslim or a non-Muslim.</P>
<P>8. The Negus was the ruler of Abyssinia. He had become a Muslim. The had&icirc;th shows that a burial service may be held over a dead body in its absence. It further shows that the funeral service consisted of four takb&icirc;rs.</P>
<P>9. Women were advised not to go perhaps, because, in the first place they could not help in carrying the bier, but more so because they might break down under grief.]</P>
</FONT><P>{p. 197}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>16</FONT></B> Al-Mugh&icirc;rah reported,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"The rider shall go behind the bier; and he who walks on foot may go behind it and before it and on its right and on its left, remaining near to it."</P>
<P ALIGN="RIGHT">(AD-Msh. 5:5.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>17</FONT></B> Ibn 'Abb&acirc;s reported,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, came to a grave apart from other graves, so he arranged the people into ranks and pronounced four takb&icirc;rs.[10]</P>
<P ALIGN="RIGHT">(B. 23:54.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>18</FONT></B> The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Whoever prays on the bier"............He called it</P>
<FONT SIZE=2><P>[10. A fuller account is given in B. 23:5. The burial service over the deceased had been held during the night. and the Holy Prophet was not informed. So he held a burial service over again on the grave. The had&icirc;th further shows that the people arranged themselves into ranks behind the im&acirc;m. The general practice is to have at least three ranks (AD-Msh. 5:5), but there is no harm if there are two (B. 23:54).]</P>
</FONT><P>{p. 198}</P>
<I><P>sal&acirc;t</I> (prayer), and there is no ruk&ucirc;' in it, nor sajdah; and no one should talk during the service; and there is in it takb&icirc;r and tasl&icirc;m; and Ibn 'Umar would not pray (on the bier) unless he had performed the wudz&ucirc;'.</P>
<P ALIGN="RIGHT">(B. 23:56.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>19</FONT></B> Samurah reported,</P>
<P>A woman died in childbirth, and the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, held a burial service over her, and stood opposite the middle (of the bier)."</P>
<P ALIGN="RIGHT">(B. 6:29.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>20</FONT></B> Talhah said,</P>
<P>I prayed on a bier behind Ibn 'Abb&acirc;s, and he recited the F&acirc;tihah and said, (1 have done this) so that</P>
<FONT SIZE=2><P>[11. This had&icirc;th is again related by Bukh&acirc;r&icirc; in 23:64 under the heading "Where to stand in the case of the woman and the man." This shows that the same position should be adopted by the im&acirc;m, whether the bier is that of a mate or a female. Im&acirc;m Ab&ucirc; Han&icirc;fa interpreted the <I>middle</I> as meaning the breast, and that is the right position of the im&acirc;m according to him, both in the case of the female and the male.]</P>
</FONT><P>{p. 199}</P>
<P>you may know that it is the Sunnah.[12]</P>
<P ALIGN="RIGHT">(B. 23:65.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>21</FONT></B> Abu Hurairah said.</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"When you pray over the dead one, be sincere in your prayer for him."[13]</P>
<P ALIGN="RIGHT">(AD-Msh. 5:5.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>22</FONT></B> Abel Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to say when he held a burial service over a bier:</P>
<P>"O All&acirc;h! Forgive our living ones and our dead ones, and those of us who are present and those who are absent, and our young</P>
<FONT SIZE=2><P>[12. Ibn 'Abb&acirc;s recited the F&acirc;tihah in a voice which others could hear, so that they might know that it was the Holy Prophet's practice. This shows that it was ordinarily recited in a low voice not audible, and further that it was meant to be so recited by the im&acirc;m as well as the congregation. The same is the case with the prayers after other takb&icirc;rs. The Fatih&acirc;h is recited after the first takb&icirc;r; <I>al-sal&acirc;t 'ala-l-Nab&icirc;</I>, as in the sitting position in prayer, after the second and an intercessory prayer for the deceased (hh. 22, 23) after the third while the tasl&icirc;m is uttered after the fourth.</P>
<P>13. The burial service is thus an intercessory prayer for the deceased one, and any prayer may be offered. Had&icirc;th contains several such prayers. The one generally adopted is given in the next had&icirc;th.]</P>
</FONT><P>{p. 200}</P>
<P>ones and our old ones, and our males and our females. O All&acirc;h! Whom Thou keepest living among us cause him to live in submission to Thee, and whom Thou causest to die from among us make him die in faith. O All&acirc;h! Do not deprive us of his reward, and do not make us fall into a trial after him."</P>
<P ALIGN="RIGHT">(AD-Msh. 5:5.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>23</FONT></B> Hasan said,</P>
<P>The <I>F&acirc;tihah</I> should be recited over the child and then one should say, O All&acirc;h! Make him for us a cause of recompense in the world to come and as one going before and a reward.[14]</P>
<P ALIGN="RIGHT">(B. 23:65.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>24</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Whoever strangles himself strangles himself into</P>
<FONT SIZE=2><P>[14. According to one report, the word <I>dhukhr-an</I> (<I>a treasure</I>) is added before the final word <I>ajr-an</I>. No burial service is held over a still-born child (B. 23:80).]</P>
</FONT><P>{p. 201}</P>
<P>fire, and whoever stabs himself with a spear stabs himself into fire."[15]</P>
<P ALIGN="RIGHT">(B. 23:81)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>25</FONT></B> J&acirc;bir said,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, gathered together in one cloth two men out of those who were killed in (the battle of) Uhud. Then he asked, "Which of them knew more of the Qur'&acirc;n"? When one of them was pointed out to him, he gave him precedence in the <I>lahd</I>, and said, "I shall be a witness of these on the Day of Resurrection". And he commanded that they should be buried with their blood (on them) and they were not washed, nor</P>
<FONT SIZE=2><P>[15. According to one had&icirc;th, the Holy Prophet did not lead the burial service of a man who committed suicide, but his companions held such a service.]</P>
</FONT><P>{p. 202}</P>
<P>was a burial service held over them."</P>
<P ALIGN="RIGHT">(B. 23:72.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>26</FONT></B> Ibn 'Umar reported,</P>
<P>When the dead body was placed in the grave, the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to say:</P>
<P>"In the name of All&acirc;h and with All&acirc;h and according to the religion of the Messenger of All&acirc;h."</P>
<P ALIGN="RIGHT">(Ah-Msh, 5:6.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>27</FONT></B> Muhammad reported without tracing it up to the Holy Prophet,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, threw on the dead body (at its burial) three handfuls of dust with both his hands, and he caused water</P>
<FONT SIZE=2><P>[16. <I>Lahd</I> (from <I>lahada</I>, <I>he inclined to a thing</I>) is an oblong excavation in the side of the grave, <I>a lateral hollow</I>, in which the dead body is placed, the opening into the grave being then closed with bricks, so that when the grave is filled with earth the body remains intact. As this had&icirc;th shows, preference was given to the <I>lahd</I>, the other body being placed in the <I>shaqq</I>, the pit itself, and therefore burial in the <I>shaqq</I> is not disallowed. In the case of a coffin, the <I>shaqq</I> alone would serve the Purpose.</P>
<P>The martyrs of Uhud were neither washed nor was a burial service held over them, and the same rule may be followed in the exigency of war or other exigencies. Towards the end of his life, however, the Holy Prophet held a burial service on the grave of the martyrs of Uhud.]</P>
</FONT><P>{p. 203}</P>
<P>to be sprinkled on the grave of his son Ibr&acirc;h&icirc;m, and placed pebbles on it.</P>
<P ALIGN="RIGHT">(Msh. 5:6.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>28</FONT></B> Sufy&acirc;n, the date-seller, reported:</P>
<P>He saw the grave of the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, gibbous-shaped.'[17]</P>
<P ALIGN="RIGHT">(B. 23: 96.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>29</FONT></B> J&acirc;bir said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, forbade the plastering of the grave, and the construction of a building on it, and sitting on it.[18]</P>
<P ALIGN="RIGHT">(M-Msh. 5:6.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>30</FONT></B> '&Acirc;'ishah, wife of the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, reported:</P>
<P>When a person of her family died and the women gathered together over it,</P>
<FONT SIZE=2><P>[17. The Arabic word is <I>musannam</I> which means <I>raised from the ground like the san&acirc;m (hump) of the camel</I>.</P>
<P>18. The prohibition to plaster, and build on a grave may have been due to the waste of money which it would involve. Sitting on the grave is prohibited because it is disrespectful.]</P>
</FONT><P>{p. 204}</P>
<P>then they dispersed, except the family of the dead and those closely related to him, she used to order a cooking-pot of <I>talb&icirc;nah</I> which was cooked, then <I>thar&icirc;d</I> was made and the <I>talb&icirc;nah</I> was cast over it then she would say, Eat of it, for I heard the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, say "The <I>talb&icirc;nah</I> gives rest to the heart of the sick one and takes away some of the grief."'[19]</P>
<P ALIGN="RIGHT">(B. 70:24.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>31</FONT></B> '&Acirc;'ishah said,</P>
<P>'When the news came</P>
<P>[19. <I>Talb&icirc;nah</I> (from <I>laban</I> meaning <I>milk</I>) is <I>food made of bran, milk and honey</I>, or simply of <I>bran and honey</I>, so called because it is white like milk; and <I>thar&icirc;d</I> is <I>bread crumbled into small pieces</I> with fingers <I>over which broth is poured</I>, sometimes prepared with marrow and with eggs, considered to be most delicious. It shows that there was a gathering when a person died, the object no doubt being to console the bereaved family. When they dispersed, food was sent by some near relative to the family itself and very nearly related friends. The whole gathering did not partake of food.]</P>
<P>{p. 205}</P>
<P>to the Prophet, of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, that Ibn H&acirc;rithah and Ja'far and Ibn Raw&acirc;hah were killed, he sat (in the mosque), and grief could be seen in his face, and I saw (him) through the opening at the pivot of the door.[20]</P>
<P ALIGN="RIGHT">(B. 23:40.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>32</FONT></B> '&Acirc;'ishah said,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Do not abuse the dead, for they have gone on to what they sent before."[21]</P>
<P ALIGN="RIGHT">(B. 23:97.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>33</FONT></B> '&Acirc;'ishah reported,</P>
<P>A man said to the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, My mother died a sudden</P>
<FONT SIZE=2><P>[20. To sit in some place so that people may come and express their sympathy with and console the bereaved family is, therefore, according to the Holy Prophet's practice. Praying for the deceased one is not forbidden, but there is no authority for the present practice to offer prayers by the raising up of hands with every new-comer. The only prayer was the burial service and a prayer on the grave.</P>
<P>21. Abuse is forbidden not only in regard to the dead from among Muslims but the dead in general. But criticism is not forbidden in any case; it sometimes becomes a necessity, as in the case of the reporters of had&icirc;th.]</P>
</FONT><P>{p. 206}</P>
<P>death, and I am sure that if she had been able to speak she would have given in charity; will she have a reward if I give in charity on her behalf? He said "Yes".[22]</P>
<P ALIGN="RIGHT">(B. 23:94.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>34</FONT></B> It is reported on the authority of Sa'd ibn 'Ub&acirc;dah that</P>
<P>His mother died while he was absent. So he said, O Messenger of All&acirc;h! My mother died while I was absent; will it benefit her if I give in charity on her behalf? He said, "Yes". He said, Then I make thee a witness that my orchard Mikhr&acirc;f is a charity on her behalf.</P>
<P ALIGN="RIGHT">(B. 55:15.)</P>
<FONT SIZE=2><P>[22. This Had&icirc;th and the one that follows show that charity on behalf of the dead is a source of benefit to them: and it appears that charity on behalf of the dead was generally practised in early Isl&acirc;m. Recital of the Holy Qur'&acirc;n to the dying ones is recommended (h. 1), but the practice of reciting the Holy {footnote p. 207} Qur'&acirc;n over the dead body or on a grave is not traceable to the Holy Prophet and is an innovation. Recital of the Holy Qur'&acirc;n is a good deed in itself, but to do it for remuneration does not bring any good to the reciter and certainly none to the dead. There is no authority of the Holy Prophet for the <I>Qul</I> ceremony on the third day, or for the ceremonies connected with the tenth and fortieth days after death. Nor can they be considered as acts of charity, for they are not for the benefit of the poor.]</P>
</FONT><P>{p. 207}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>35</FONT></B> Buraidah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to teach them (to say), when they went forth to the graves:</P>
<P>"Peace be with you, Dwellers of this abode! from among the faithful and the Muslims; and we, if it please All&acirc;h, will join you; we ask of All&acirc;h security for ourselves and for you."</P>
<P ALIGN="RIGHT">(M-Msh. 5:8.)</P>
<P>{p. 208}</P>
<HR>
<CENTER>
<A HREF="had19.htm">Next: Chapter XVI CHARITY AND ZAK&Acirc;T</A></CENTER>
</BODY>
</HTML>
