<HTML>
<HEAD>
<TITLE>Chapter XII '&Icirc;D SERVICE</TITLE>
</HEAD>
<BODY>
<CENTER>
<A HREF="../../index.htm">Sacred Texts</A>&nbsp;
<A HREF="../index.htm">Islam</A>&nbsp;
<A HREF="index.htm">Index</A>&nbsp;
<A HREF="had14.htm">Previous</A>&nbsp;
<A HREF="had16.htm">Next</A>&nbsp;
</CENTER>
<HR>
<H1 ALIGN="CENTER">CHAPTER XII</H1>
<H3 ALIGN="CENTER">'&Icirc;D SERVICE</H3><DIR>
<DIR>

<P>1. "It is not their flesh nor their blood that reaches All&acirc;h, but to Him is acceptable righteousness on your part" (22:37).</P>
<P>2. "When they fall down eat of them and feed the poor man who is contented and the beggar" (22:36).</P></DIR>
</DIR>

<P>The word <I>'&Icirc;d</I> (from <I>'&acirc;da</I>, <I>he</I> or <I>it returned</I>) is literally "<I>the time of return</I> of joy and of grief" (LL), and hence it comes to indicate <I>a festival</I> or <I>a periodical festival</I>, The word '&Icirc;d itself occurs in the Holy Qur'&acirc;n only in connection with the prayer of Jesus for bread for his disciples in the sense of <I>an ever-recurring happiness</I> (5:114). There are two festivals among the Muslims (h. 3), the festival of sacrifices, called '&Icirc;d al-Adzh&acirc;, (<I>dzuh&acirc;</I> meaning <I>early part of the day</I>, and <I>dz&acirc;hh&acirc;</I>, <I>he sacrificed a victim in the time of dzuh&acirc;</I>, and the festival of breaking fasts, called '&Icirc;d al-Fitr (<I>fatara</I> meaning <I>he split a thing</I>, and <I>aftara</I>, <I>he broke the fast</I>). In the Holy Qur'&acirc;n, a reference to '&Icirc;d al-Adzh&acirc; is contained in the course of the mention of the sacrifice which is the chief feature of that day (v. 1-2).</P>
<P>The dates for the two '&Icirc;ds are determined with reference to the appearance of the new moon, and hence certain rules are laid down when there is doubt about it (hh. 1, 2) The festivals start, not with any physical enjoyment but with an act of bowing before God. so that the spiritual awakening thus brought about may serve as a restraint on physical enjoyment (h. 3). A sermon is delivered by the im&acirc;m after two rak'ahs of prayer have been said. and stress is laid in it on matters relating to the welfare of the community (hh. 3, 4). No adh&acirc;n is delivered, nor the iq&acirc;mah; a number of additional takb&icirc;rs is, however, pronounced during the service (hh. 5. 6). Women and children are also required to join in the service and listen to the sermon (hh. 7, 8). The '&Icirc;d service is held wherever there is a number of Muslims, whether it is a town or a village or a solitary place (h. 8). In the '&Icirc;d al-Fitr it is necessary to take some food before going out to pray (h. 9). The taking of a bath is also necessary (h. 10). The '&Icirc;d prayer should be said at an early hour, say by breakfast time (h 11). The Holy Prophet generally took a different route on returning from the place of prayer (h. 12). Sacrifice should not be offered until prayer has been said (h. 13), Everyone who has the means is required to sacrifice an animal (h. 14). Some details regarding the animals to be sacrificed are given in (hh. 15, 16). One goat</P>
<P>{p. 166}</P>
<P>or one sheep is sufficient for one man or one household, but seven men may be partners in one cow or one camel (h. 17). The animals may be sacrificed either on the day of '&Icirc;d or on the two following days (h. 18). A part of the meat of the animal sacrificed is distributed among the poor, and the price of the skin must be devoted to charitable objects (H. xviii:26). A charitable institution is also connected with the '&Icirc;d al-Fitr in the form of Fitr charity which must be collected at a central place and then distributed (hh. 19. 20). When the '&Icirc;d occurs on a Friday, the Friday service becomes optional (h. 21). A little music or sport is not prohibited on the '&Icirc;d day (h. 22).</P>
<P><B><FONT SIZE=5 COLOR=GREEN>1</FONT></B> Ibn 'Umar reported that,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, mentioned Ramadz&acirc;n and said:</P>
<P>"Do not keep the fast until you see the new moon, and do not discontinue the keeping of fast until you see it (again), and if it be veiled to you (by cloud, etc.), have it measured."</P>
<P ALIGN="RIGHT">(B. 30:11.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>2</FONT></B> Ibn 'Umar reported that,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"The month is (sometimes) twenty-nine nights, so do not keep the fast until you see (the new moon), and if it be veiled to you (by cloud, etc.), then complete the number thirty."[1]</P>
<P ALIGN="RIGHT">(B. 30:11)</P>
<FONT SIZE=2><P>[1. The interval between one new moon and the next is sometimes twenty-nine days and sometimes thirty. If there is cloud or mist, and the new moon cannot {footnote p. 167} be seen, there are two ways suggested to determine its appearance; either thirty days may be completed (h. 2), or the appearance of the new moon may be determined by calculation based on the course of the moon (h. 1). According to another had&icirc;th (B. 30:13), the Arabs did not keep an account of the course of the moon, and therefore the easier way for them was to complete the interval of thirty days. It follows, therefore. that it is not forbidden for a people who keep the account to determine the appearance of the moon from its course. This would bring about more uniformity in the observance of the '&Icirc;d in one country. Wireless, however, has made uniformity possible even if the actual appearance of the moon is depended upon.]</P>
</FONT><P>{p. 167}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>3</FONT></B> Ab&ucirc; Sa'&icirc;d said,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to go forth on the day of the Fitr and the Adzh&acirc; to the Musall&acirc;; so the first thing that he did was the saying of prayer; then he turned and stood facing the people while the people were sitting in their rows, and he admonished them and gave them injunctions and commands; then if he intended to raise an army, he gave the orders for it, or if he intended to command any (other) thing, he commanded it; then he returned.[2]</P>
<P ALIGN="RIGHT">(B. 13:6.)</P>
<FONT SIZE=2><P>[2. The Musall&acirc; (lit. the place of prayer) means here the place where the '&Icirc;d service was generally held. In the '&Icirc;d service, the prayers were said first and the sermon delivered afterwards. The sermon not only contained general injunctions but also dealt with measures relating to the welfare of the community.]</P>
</FONT><P>{p. 163}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>4</FONT></B> Ibn 'Abb&acirc;s reported that,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said two rak'ahs of prayer on the day of the Fitr, and he did not say any prayer before it, nor after it; then he came to the women and with him was Bil&acirc;l, and he commanded them to give charity; so they began to throw away (their ornaments),--a woman gave away her ear-ring and her necklace.[3]</P>
<P ALIGN="RIGHT">(B. 13:8)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>5</FONT></B> J&acirc;bir ibn Samurah said,</P>
<P>I said both the '&Icirc;d prayers with the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, not once or twice, without adh&acirc;n and without iq&acirc;mah.</P>
<P ALIGN="RIGHT">(M-Msh. 4:47.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>6</FONT></B> Kath&icirc;r reported on the authority of his grandfather that,</P>
<FONT SIZE=2><P>[3. In the sermon the men were asked to join the army if the raising of an army was necessary, and the women were asked to contribute to the expenses. Charity in the Holy Prophet's day was directed as much towards the defence of the community as towards the help of the poor.]</P>
</FONT><P>{p. 169}</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, uttered takb&icirc;rs in both '&Icirc;d services seven times in the first (rak'ah) before the recitation (of the F&acirc;tihah), and five times in the second (rak'ah) before recitation.'</P>
<P ALIGN="RIGHT">(Tr-Msh. 4:47.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>7</FONT></B> Umm 'Atiyyah said,</P>
<P>We (women) were commanded to go forth on the day of '&Icirc;d, in so far as to make a virgin leave her curtain and to require (even) menstruating women to turn out; and they (the women) were behind the men, and they uttered the takb&icirc;r, along with their takb&icirc;r, and they made their supplications along with their supplications, hoping for the blessings of that day and its purification.[5]</P>
<P ALIGN="RIGHT">(B. 13:12 )</P>
<FONT SIZE=2><P>[4. According to another had&icirc;th, four takb&icirc;rs were uttered (AD-Msh. 4:47).</P>
<P>5. All women, even young girls, were commanded to go forth for the '&Icirc;d service. Menstruating women took part in all functions: only they did not join the prayer-service (B. 13:15).]</P>
</FONT><P>{p. 170}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>8</FONT></B> Anas ordered his slave</P>
<P>Ibn Ab&ucirc; 'Utbah at Z&acirc;wiya, so he gathered together the people of his household and his sons, and held prayer service just as the residents of the towns hold prayer service and utter takb&icirc;rs.</P>
<P ALIGN="RIGHT">(B. 13:25)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>9</FONT></B> Anas said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, did not go out on the morning of the day of the Fitr till he had eaten some dates.[6]</P>
<P ALIGN="RIGHT">(B. 13:4.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>10</FONT></B> Ibn 'Abb&acirc;s said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to take a bath on the day of the Fitr and the day of the Adzh&acirc;.</P>
<P ALIGN="RIGHT">(IM. 5:166)</P>
<FONT SIZE=2><P>[6. Being the festival of breaking fasts, it is necessary that something should be eaten before prayer, According to another had&icirc;th, food should be taken on the 'Id al-Adzh&acirc; after prayers have been said, but this perhaps refers to partaking of the meat of the animal sacrificed.]</P>
</FONT><P>{p. 171}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>11</FONT></B> It is reported on the authority of 'Abd All&acirc;h ibn Busr that,</P>
<P>He went forth with the people on the day of the Fitr or the Adzh&acirc;, and disapproved of the delay of the im&acirc;m and said, We used to have finished by this time; and it was the time of the prayer after sunrise.[7]</P>
<P ALIGN="RIGHT">(IM. 5:170)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>12</FONT></B> J&acirc;bir said,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to change the route on the day of the '&Icirc;d.</P>
<P ALIGN="RIGHT">(B. 13:24.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>13</FONT></B> Bar&acirc;' said,</P>
<P>I heard the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, delivering a sermon, so he said</P>
<P>"The first thing that we do on this day of ours is</P>
<FONT SIZE=2><P>[7. The time of the '&Icirc;d prayer is the breakfast time.</P>
<P>8. He went to the place of prayer by one way and came back by another, so that greater numbers of the public might see with their own eyes that Muslims sought communion with the Divine Being even in their festivals.]</P>
</FONT><P>{p. 172}</P>
<P>that we say prayers, then we go back and sacrifice (an animal); so whoever does (this) abides by our sunnah."[9]</P>
<P ALIGN="RIGHT">(B. 13:3.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>14</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Whoever has the means but does not sacrifice (an animal), let him not come to our place of prayer."</P>
<P ALIGN="RIGHT">(Ah. II, 321.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>15</FONT></B> J&acirc;bir said, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Do not slaughter but a <I>musinnah</I>, unless it is difficult for you (to get it); in that case, slaughter a <I>jadha'ah</I> from among the sheep.[10]</P>
<P ALIGN="RIGHT">(M-Msh. 4:48.)</P>
<FONT SIZE=2><P>[9. This relates to the '&Icirc;d al-Adzh&acirc;. Sacrifice was not allowed before prayers, for such procedure would have given precedence to the physical enjoyment of partaking of meat over the spiritual bliss of bowing before God.</P>
<P>10 <I>Musinnah</I> means <I>full-grown</I>, "and is applied to an animal of the ox-kind and to the sheep or goat, at the least in the third year." <I>Jadh&acirc;'ah</I> "as applied to a sheep, <I>a year old</I>: and sometime <I>less than a year</I>...; or <I>eight months old</I> or <I>nine</I>... or from <I>six months old to seven</I>........and applied to a goat a year old.......; applied to a bull, in his second year or in his third year: and applied to a camel in his fifth year" (LL).]</P>
</FONT><P>{p. 173}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>16</FONT></B> Bar&acirc; ibn '&Acirc;zib reported that,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, was asked as to what sacrifices should be avoided. He pointed out with his hand and said:</P>
<P>"Four: The lame one whose limping is manifest and the blind of one eye whose disfigurement is manifest, and the diseased one whose disease is manifest, and the emaciated one which has no marrow left in its bones."[11]</P>
<P ALIGN="RIGHT">(AD-Msh. 4:48.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>17</FONT></B> J&acirc;bir reported that,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said,</P>
<P>"(Sacrifice of)[18] a cow (suffices) for seven, (persons) and that of a camel for seven (persons).</P>
<P ALIGN="RIGHT">(M-Msh. 4:48.)</P>
<P><FONT SIZE=2>[11. This shows that the animal to be sacrificed should be healthy and sound, without any manifest disfigurement.</P>
<P>12. One goat or one sheep for one man or one household is the rule, but a cow or a camel would suffice for seven, the latter even for ten according to another Had&icirc;th (Tr-Msh. 4:48).]</FONT></P>
<P>{p. 174}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>18</FONT></B> Ibn 'Umar said,</P>
<P>Al-Adzh&acirc; 'lasts two days after the day of Adzh&acirc;.[13] (M-Msh. 4:48.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>19</FONT></B> Ibn 'Umar said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, made the charity of the Fitr-one s&acirc;' of dates or one s&acirc;' of barley -obligatory on every slave and free man, male and female, minor and major, from among Muslims, and ordered that it should be paid before people go out for ('&Icirc;d) prayer." (13. 24. 70.)</P>
<FONT SIZE=2><P>[13. The animal to be sacrificed may be slaughtered on the day of the '&Icirc;d after the prayers have been said or at any time during the two following days, these being the days of the pilgrims' stay in Min&acirc;.</P>
<P>14. Charity, like prayer, constitutes a distinguishing characteristic of both 'Id festivals. In the '&Icirc;d al-Adzh&acirc;, charity takes the form of the distribution of the meat of the sacrificed animal, and the price of its skin which must be devoted to some charitable object; and in the '&Icirc;d al-Fitr, it is made obligatory in the form of Fitr charity. The s&acirc;' was an Arab measure for grain weighing about four seers. Under present conditions money-value of the s&acirc;' would be about four annas in Pakistan, and that may safely be taken as the standard for Fitr charity for each individual, including children.]</P>
</FONT><P>{p. 175}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>20</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, appointed me to guard the charity of Ramadz&acirc;n.[15]</P>
<P ALIGN="RIGHT">(B. 40:10)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>21</FONT></B> Ibn 'Umar said,</P>
<P>Two '&Icirc;ds occurred together[16] in the time of the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, So he performed the ('&Icirc;d) prayer with the people, then said: "Whoever desires to come to the Friday service, he may come; and whoever desires to remain absent, he may remain absent."</P>
<P ALIGN="RIGHT">(I M. 5:166.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>22</FONT></B> '&Acirc;'ishah reported that,</P>
<P>'Ab&ucirc; Bakr paid her a visit in the days of Min&acirc;, and with her were two girls playing on a tambourine</P>
<FONT SIZE=2><P>[15. In the Holy Prophet's time, the Fitr charity was collected at a centre and then distributed. The present practice in the Muslim world to leave it to individual choice is against the Holy Prophet's Sunnah. Worked out as an institution as it was in the Holy Prophet's time, it can prove a source of immense benefit to the Muslim community.</P>
<P>16. By two '&Icirc;ds are meant the '&Icirc;d and Friday.]</P>
</FONT><P>{p. 176}</P>
<P>and beating (it), and the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, covered himself up with his cloth. Abu Bakr upbraided them, but the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, uncovered his face and said: "Leave them alone, O Ab&ucirc; Bakr! for these are the days of '&Icirc;d."</P>
<P ALIGN="RIGHT">(B. 13:25.)</P>
<P>{p. 177}</P>
<HR>
<CENTER>
<A HREF="had16.htm">Next: Chapter XIII SUPEREROGATORY PRAYERS</A></CENTER>
</BODY>
</HTML>
