<HTML>
<HEAD>
<TITLE>Chapter VIII INSTITUTION OF PRAYER</TITLE>
</HEAD>
<BODY>
<CENTER>
<A HREF="../../index.htm">Sacred Texts</A>&nbsp;
<A HREF="../index.htm">Islam</A>&nbsp;
<A HREF="index.htm">Index</A>&nbsp;
<A HREF="had10.htm">Previous</A>&nbsp;
<A HREF="had12.htm">Next</A>&nbsp;
</CENTER>
<HR>
<H1 ALIGN="CENTER">CHAPTER VIII</H1>
<H3 ALIGN="CENTER">THE IM&Acirc;M</H3><DIR>
<DIR>

<P>1. And when his Lord tried Abraham with certain words, he fulfilled them. He said, Surely I will make thee a leader (im&acirc;m) of men. Abraham, said, And of my offspring? My covenant does not include the unjust, said He." (2: 124.)</P></DIR>
</DIR>

<I><P>Im&acirc;m</I> is literally <I>one who is imitated</I> or <I>whose example is followed</I> from <I>i'tamma bi-h&icirc;</I>, <I>he followed</I> or <I>imitated him</I>. It generally means a head or a chief or a leader whether he follows the right way or not. In relation to congregational prayers, the im&acirc;m is the person who leads the prayer. Abraham is spoken of as having been made an im&acirc;m because he fulfilled the Divine commandments--and every im&acirc;m should try to follow his example; and an unjust person did not deserve to be made a leader--even though he may be of high parentage (v. 1).</P>
<P>That the man who leads the prayers is called an im&acirc;m shows that he should be one occupying the highest place of honour in his community on account of his righteousness. While alive, the Holy Prophet himself acted as im&acirc;m; and when he was unable during his last illness to perform that function, he ordered that Ab&ucirc; Bakr should act as im&acirc;m (h. 1).</P>
<P>The honour of acting as an im&acirc;m should be conferred upon the man who occupies the highest place of honour in a community (h. 1): it is further laid down that the man having the greatest knowledge of the Qur'&acirc;n should be chosen as im&acirc;m (hh. 2, 3), even though he be a slave (h. 4). He should not be paid any remuneration for leading prayers (H. vi:12), It is not, however, prohibited to say prayers behind an im&acirc;m who is either a usurper (h. 5) or an unrighteous person (b. 6). A blind man is not unfit to lead the prayers (h. 7), nor is a woman (h. 8). The im&acirc;m should have regard for the weak and the sick among those who follow him (h. 9). Those who follow the im&acirc;m shall not anticipate him in any movement (h. 10). When a person joins the congregational service, he should start his prayer where he finds the im&acirc;m (h. 11). The position which the im&acirc;m occupies in relation to the congregation is explained in hh. 12-14. There is no harm if a wall intervenes between the im&acirc;m and the congregation (b. 15).</P>
<P>{p. 111}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>1</FONT></B> Ab&ucirc; M&ucirc;s&acirc; said, The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, fell ill and his illness became severe; so he said:</P>
<P>"Tell Ab&ucirc; Bakr that he should lead the prayer for the people."[1] ... So the messenger came to him, and he (Ab&ucirc; Bakr) led the prayer for the people in the lifetime of the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>.</P>
<P ALIGN="RIGHT">(B. 10:46.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>2</FONT></B> Ab&ucirc; Mas'&ucirc;d said, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said</P>
<P>"The man who knows most the Book of All&acirc;h shall act as im&acirc;m of a people;[2] and if there are persons equal in their knowledge of the Qur'&acirc;n, then he who has greater knowledge of</P>
<FONT SIZE=2><P>[1. While alive, the Holy Prophet himself acted as im&acirc;m and led the prayers. During his last illness he became too weak to leave his bed and to go out to pray in congregation; so he directed that Ab&ucirc; Bakr should lead the prayers. This Had&icirc;th, along with the Holy Prophet's practice, is conclusive proof that the man who held the highest place of honour in the community on account of his righteousness acted as im&acirc;m, for after the Holy Prophet Ab&ucirc; Bakr was admittedly the most excellent of his followers.</P>
<P>2. Evidently what is meant is excellence in knowledge of the Holy Qur'&acirc;n. not merely its recitation.]</P>
</FONT><P>{p. 112}</P>
<P>the Sunnah; and if they are equal in their knowledge of the Sunnah, then he who is first in <I>hijrah</I>; [3] and if they are equal in <I>hijrah</I>, then he who is older in years; and a man shall not lead another in prayer in the place where he (the latter) is in authority,[4] and no one shall occupy the place of honour in another man's house except with his permission.</P>
<P ALIGN="RIGHT">(M-Msh. 4:26.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>3</FONT></B> Ibn 'Abb&acirc;s said, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"The most virtuous among you shall deliver the adh&acirc;n, and those having most knowledge of the Qur'&acirc;n shall act as imams."[5]</P>
<P>(AD-Msh 4:26.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>4</FONT></B> Ibn 'Umar said, When the first emigrants</P>
<FONT SIZE=2><P>[3. Precedence in <I>hijrah</I> was an indication of precedence in sacrifices for Isl&acirc;m.</P>
<P>4. Thus the master of the house or the im&acirc;m of a particular mosque has a greater right to lead the prayers there than a mere visitor.</P>
<P>5. The mu'adhdhin and the im&acirc;m, the two office-bearers of the mosque, are thus to be chosen for their moral excellence and knowledge of the Qur'&acirc;n.]</P>
</FONT><P>{p. 213}</P>
<P>came to 'Usbah, a place in Qub&acirc;', before the coming of the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, the slave of Abu Hudhaifah, used to act as their im&acirc;m, and he had the greatest knowledge of the Qur'&acirc;n.[6]</P>
<P>(B. 10: 54)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>5</FONT></B> 'Ubaid All&acirc;h reported that He entered upon 'Uthm&acirc;n ibn 'Aff&acirc;n and he was then besieged (by the rebels). He said, Thou art the im&acirc;m of the people and to thee has happened what thou seest, and the rebel im&acirc;m leads our prayers and we consider this to be a sin. He said, Prayer is the best of things which people do; so when people do a good work, do thou also do the good with them, and when they do evil, do thou shun their evil.</P>
<P ALIGN="RIGHT">(B. 10:56.)</P>
<FONT SIZE=2><P>[6. A slave became the im&acirc;m because he excelled others in knowledge.]</P>
</FONT><P>{p. 114}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>6</FONT></B> Ab&ucirc; Hurairah said, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Jih&acirc;d is incumbent on you under every commander whether he is virtuous or wicked, even though he be guilty of heinous sins and prayer is incumbent on you behind every Muslim whether he is virtuous or wicked, even though he be guilty of heinous sins;[7] and the holding of a (funeral) service on every Muslim is incumbent whether he is virtuous or wicked, even though he be guilty of heinous sins."</P>
<P ALIGN="RIGHT">(AD-Msh. 4:26)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>7</FONT></B> Anas reported that The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, left Ibn Umm Makt&ucirc;m after him to act as im&acirc;m of the people, and he</P>
<FONT SIZE=2><P>[7. No one can be chosen as im&acirc;m for carrying on jih&acirc;d or for leading prayers unless he possesses the requisite qualifications. and, therefore, a man who is guilty of heinous sins cannot be chosen for either purpose. But if such a {footnote p. 115} man is chosen by mistake or if he commits such a sin after he has been chosen, he must be followed so long as he is not removed from that office, as no organization can be maintained otherwise.]</P>
</FONT><P>{p. 115}</P>
<P>was a blind man.</P>
<P ALIGN="RIGHT">(AD. 2:64.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>8</FONT></B> It is reported about Umm Waraqah who had learned the Qur'&acirc;n by heart that The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, commanded her that she should act as im&acirc;m of the people of her house, and she had a mu'adhdhin and she used to act as im&acirc;m of the people of her house.[8]</P>
<P ALIGN="RIGHT">(Ah. VI, 405)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>9</FONT></B> Ab&ucirc; Hurairah reported that The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"When one of you leads the prayer for the people, he should lighten it, for among them is the weak one and the sick one and the old one; and when one</P>
<FONT SIZE=2><P>[8. This shows that a woman may act as im&acirc;m. There is nothing to show that there were no males among the people of her house; on the other hand. it is clearly stated that she had a mu'adhdhin who was evidently a male.]</P>
</FONT><P>{p. 116}</P>
<P>of you prays alone, he may lengthen (it) as he likes."</P>
<P ALIGN="RIGHT">(B. 10:62.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>10</FONT></B> Bar&acirc;' said,</P>
<P>It was the practice that when the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said <I>sami' All&acirc;hu li-man hamidah&ucirc;</I>, none of us bent down his back (for falling down in prostration) until the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, fell down in prostration, and then we fell down in prostration after him."</P>
<P ALIGN="RIGHT">(B. 10:52.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>11</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"When you come to prayer, and we have fallen down in prostration, fall down in prostration and do not count it as anything, and whoever joins in one rak'ah joins the prayers."[9]</P>
<P ALIGN="RIGHT">(AD-Msh. 4:28.)</P>
<FONT SIZE=2><P>[9. If a man joins the congregational service in sajdah, it should not be counted as a rak'ah, from which it follows that if he joins it in ruk&ucirc;', it shall be counted as a rak'ah.]</P>
</FONT><P>{p. 117}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>12</FONT></B> Samurah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, commanded us that when we were three, one of us should stand in the front.</P>
<P ALIGN="RIGHT">(Tr-Msh. 4:25.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>13</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Keep the im&acirc;m in the middle and close the openings."[10]</P>
<P ALIGN="RIGHT">(AD-Msh. 4:24.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>14</FONT></B> Ibn 'Abb&acirc;s said,</P>
<P>I said my prayers with the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, on a certain night and 1 stood on his left, and the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, took hold of my head from, behind me and placed me on his right</P>
<FONT SIZE=2><P>[10. Hh. 12, 13 give the position of the im&acirc;m. He should stand in the front, forming a row by himself, and he should also be in the middle, so that the rows behind him should have an equal number of men on his right and left.]</P>
</FONT><P>{p. 118}</P>
<P>hand, then he said prayers.[11]</P>
<P ALIGN="RIGHT">(B. 10:77.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>15</FONT></B> '&Acirc;'ishah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, used to say his prayers at night in his enclosure, and the wall of the enclosure was low, so the people saw the person of the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, (standing in prayers), and some people got up and followed him in his prayers.[12]</P>
<P ALIGN="RIGHT">(B. 10:80)</P>
<FONT SIZE=2><P>[11. If there are only two men in a congregational service, they should stand in the same row. the im&acirc;m standing on the left. If, however, a third man joins later, either the im&acirc;m should go forward and stand in front, or the first follower should step behind, forming with the new-comer a row behind the im&acirc;m.</P>
<P>12. This was the Holy Prophet's tahajjud prayer in the mosque during Ramadz&acirc;n. The enclosure was made of mats. The had&icirc;th shows that there is harm if anything intervenes between the im&acirc;m and the congregation.]</P>
</FONT><P>{p. 119}</P>
<HR>
<CENTER>
<A HREF="had12.htm">Next: Chapter IX INSTITUTION OF PRAYER</A></CENTER>
</BODY>
</HTML>
