<HTML>
<HEAD>
<TITLE>Chapter XIX JIH&Acirc;D</TITLE>
</HEAD>
<BODY>
<CENTER>
<A HREF="../../index.htm">Sacred Texts</A>&nbsp;
<A HREF="../index.htm">Islam</A>&nbsp;
<A HREF="index.htm">Index</A>&nbsp;
<A HREF="had21.htm">Previous</A>&nbsp;
<A HREF="had23.htm">Next</A>&nbsp;
</CENTER>
<HR>
<H1 ALIGN="CENTER">CHAPTER XIX</H1>
<H3 ALIGN="CENTER">JIH&Acirc;D</H3><DIR>
<DIR>

<P>1. "And those who strive hard for Us, We will certainly guide them in Our ways" (29:69).</P>
<P>2. "Strive hard against them a mighty striving with it (the Qur'&acirc;n)" (25:52).</P>
<P>3. "And from among you there should be a party who invite to good and enjoin what is right and forbid the wrong. and these it is that shall be successful" (3:103).</P>
<P>4. "There is no compulsion in religion" (2:256).</P>
<P>5. "And fight in the way of All&acirc;h with those who fight with you and do not exceed this limit" (2:190).</P>
<P>6. "And they will not cease fighting with you until they turn you back from your religion if they can" (2:217).</P>
<P>7. "And fight with them until there is no persecution and all religions are only for All&acirc;h" (8:39).</P>
<P>8. "And if they incline to peace, do thou incline to it and trust in All&acirc;h And if they intend to deceive thee, then surely All&acirc;h is sufficient for thee" (8:61, 62).</P>
<P>9. "He it is who has sent His Messenger with the guidance and the true religion that He may make it overcome all (other) religions." (61:9).</P></DIR>
</DIR>

<P>Jih&acirc;d means the exerting of one's power in repelling the enemy or in contending with an object of disapprobation. It carries a twofold significance in Isl&acirc;m, being applied to both. the purely missionary activities of a Muslim and his defence of the Faith. when necessary, in a physical sense. The first duty--the duty to invite people to Isl&acirc;m--is a permanent duty laid upon all Muslims of all ages; while the second is a duty which arises upon certain contingencies. The Holy Qur'&acirc;n calls attention to both these duties in the clearest and most forceful words. In the first place, it speaks of a jih&acirc;d to attain to All&acirc;h (v. 1). Then it speaks of carrying on a jih&acirc;d against unbelievers by means of the Holy Qur'&acirc;n, and this it calls <I>jih&acirc;d-an kab&icirc;r-an</I>, a very great jih&acirc;d (v. 2). Isl&acirc;m's greatest jih&acirc;d is, therefore, not by means of the sword, but by means of the Holy</P>
<P>{p. 253}</P>
<P>Qur'&acirc;n, <I>i.e.</I>, a missionary effort to establish Isl&acirc;m. We are further told that there should always be among Muslims a party who invite people to Isl&acirc;m (v. 3). Thus the missionary jih&acirc;d of Isl&acirc;m is to be carried on in all circumstances.</P>
<P>The sword could never be used to force Isl&acirc;m on others. compulsion in religion being forbidden in clear words (v. 4). Fighting was undoubtedly allowed but it was expressly allowed only as a defensive measure against those who were bent upon annihilating Isl&acirc;m by the sword, not to compel people to accept Isl&acirc;m (vv. 5, 6). When persecution ceased and everyone was at liberty to profess whatever religion he liked, the sword had to be sheathed (v. 7). Even in the midst of the war, if the enemy wanted peace, war was to be discontinued (v. 8). The good news is finally given that not only will Isl&acirc;m not be annihilated but it would ultimately be ascendant over all other religions (v. 9).</P>
<P>Had&icirc;th also speaks of both kinds of jih&acirc;d. It is a Muslim's foremost duty, and the most excellent deed a Muslim can do (hh. 1, 2). A promise is given that if Muslims exerted themselves to their utmost to uphold the cause of Isl&acirc;m, they would be in the ascendant (hh. 3, 4). There is a further promise that divinely inspired persons, called <I>rnujaddids</I>, shall appear among Muslims to revive the faith (h. 5), and that a Messiah shall appear among them to carry the message of Isl&acirc;m to the Christian nations of the world in particular (h. 6).</P>
<P>Guiding a man to truth is spoken of as a Muslim's greatest treasure (h. 7), and the Holy Prophet himself wrote letters to kings in the 6th year of Hijrah, inviting them to accept Isl&acirc;m (h. 8). He never threatened any of them with invasion if his message was not accepted (h. 9). Muslims had to fight their battles, but this they had to do simply to defend Isl&acirc;m which unbelievers wanted to annihilate (vv. 5. 6) The cause of Truth was, however, to be defended unto death (h. 10), and Muslims were told to be always ready, if the need arose, to defend the Faith with the sword, that being the way to Paradise (h. 11). The Holy Prophet's own soul yearned after martyrdom in defence of the Truth and if possible. to come back to life and die again defending the Truth (h. 12), and such should, therefore, be the desire of every Muslim. Martyrdom could, however, be attained in other ways too (h. 13). Even women took part in the battles which were being fought in defence of Isl&acirc;m (hh. 14, 15), Non-combatants were not to be killed in battle, there being a prohibition against the killing of women and children (h. 16). Fighting was to cease if the enemy offered peace, even though his intention might be to deceive (v. 8), or if the enemy entered the brotherhood of Isl&acirc;m (h. 17).</P>
<P><B><FONT SIZE=5 COLOR=GREEN>1</FONT></B> Abu Hurairah said,</P>
<P>A man came to the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, and said,</P>
<P>{p. 254}</P>
<P>Guide me to a deed which is equal to jih&acirc;d. He said, "I do not find it." (Then) he said: "Is it in thy power that when the one engaged in jih&acirc;d goes forth, thou shouldst enter thy mosque and stand in prayer and have no rest, and that thou shouldst fast and break it not?" He said, Who can do it?</P>
<P ALIGN="RIGHT">(B. 56:l.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>2</FONT></B> Ab&ucirc; Sa'&icirc;d al-Khudr&icirc; said,</P>
<P>It was said, O Messenger of All&acirc;h! Who is the most excellent of men? The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said, "The believer who strives hard in the way of All&acirc;h with his person and his property."</P>
<P ALIGN="RIGHT">(B. 56:2)</P>
<P>{p. 255}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>3</FONT></B> Mugh&icirc;rah reported,</P>
<P>The Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said,</P>
<P>"Some people from among my community shall remain in the ascendant, until the command of All&acirc;h comes to them and they shall be triumphant."[1] (B. 61:28.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>4</FONT></B> 'Imr&acirc;n ibn Husain said,</P>
<P>'The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said</P>
<P>"A party of my community shall not cease fighting for the Truth--they shall be triumphant over their opponents. "[2]</P>
<P ALIGN="RIGHT">(AD-Msh. 18.)</P>
<FONT SIZE=2><P>[1. In the heading of 97:10. this had&icirc;th is related with a slight variation: "A party of my umma shall remain in the ascendant, propagating the Truth, and these are the learned ones (<I>ahl al-'ilm</I>)." This shows that Bukh&acirc;r&icirc; took the word jih&acirc;d in the wider sense.</P>
<P>2. The following explanation of this had&icirc;th is given in the <I>'Aun al-Ma'b&ucirc;d</I>, a commentary of <I>Ad&ucirc; Daw&ucirc;d</I>, on the authority of Nawav&icirc;: "This party consists of different classes of the faithful, of them being the brave fighters, the <I>faq&icirc;hs</I> (jurists), the <I>muhaddith&icirc;n</I> (collectors of Had&icirc;th), the <I>z&acirc;hids</I> (those who devote themselves to the worship of God), those who command the doing of good and prohibit evil, and a variety of other people who do other good deeds." Fighting in the way of All&acirc;h thus includes the service of Isl&acirc;m in any form.]</P>
</FONT><P>{p. 256}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>5</FONT></B> Ab&ucirc; Hurairah reported,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>"Surely All&acirc;h will raise for this community at the beginning of every century one who shall revive for it its faith."[3]</P>
<P ALIGN="RIGHT">(AD. 36:1.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>6</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said</P>
<P>"How would you feel</P>
<FONT SIZE=2><P>[3. The preceding two Had&icirc;th contain a prophecy that among the Muslim community there shall always be learned people who shall help the cause of Isl&acirc;m to become ascendant in the world; this goes a step further and contains a further prophecy that generally at intervals of a century divinely inspired people shall be raised among Muslims and they shall revive the faith of the Muslim community.</P>
<P>A person thus raised by God is called a <I>mujaddid</I> (<I>one who revives</I>) in the terminology of Isl&acirc;m. The mujaddid is a <I>muhaddath</I> (one to whom God speaks though he is not a prophet), and he is raised up by God to remove errors that have crept in among Muslims and to shed new light on the great religious truths of Isl&acirc;m in the new circumstances which Muslims may have to face in every new age. The most famous names falling under this category in this country are those of Sayyid Ahmad of Sirhind, popularly known as <I>Mujaddid Alf Th&acirc;ni</I>, Sh&acirc;h Wal&icirc; All&acirc;h of Delhi, Sayyid Ahmad of Bareily, and Mirz&acirc; Ghul&acirc;m Ahmad of Q&acirc;di&acirc;n, the founder of the Ahmadiyyah movement, who was accepted generally as the Mujaddid of the fourteenth century of Hijrah, but who was later opposed owing to his claim to be the Messiah, whose advent is spoken of in Had&icirc;th prophecies.]</P>
</FONT><P>{p. 257}</P>
<P>when the son of Mary makes his appearance among you, and he is your im&acirc;m from among yourselves."[4] (B. 60:49.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>7</FONT></B> Sahl reported,</P>
<P>He heard the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, say:</P>
<FONT SIZE=2><P>[4. This is a further prophecy relating to the ascendancy of Isl&acirc;m. The son Of Mary is the Messiah, and Muslims are told that a Messiah would appear among them. This Messiah is called <I>im&acirc;mu-kum min-kum</I> <I>i.e.</I>, <I>your im&acirc;m from among yourselves</I>. In a had&icirc;th of the <I>Sahih Muslim</I> on the same subject, the words are <I>wa amma-kum min-kum</I>, <I>i.e.</I>, he (the Messiah) shall be your im&acirc;m from among yourselves, leaving no doubt that a member of the Muslim community would be raised to the dignity of the Messiah. These words were no doubt added by the Holy Prophet to remove the possible misconception that the Israelite Messiah would appear among Muslims.</P>
<P>The prophecy relating to the advent of a Messiah among Muslims, generally known as the second advent of the Messiah, is on all fours with the prophecy relating to the second advent of Elias among the Israelites: "Elijah went up by a whirlwind into heaven" (II Kings 2:11); "I will send you Elijah the prophet before the coming of the great and dreadful day of the Lord" (Mal. 4:5). When Jesus Christ was confronted with this difficulty--"Why then say the Scribes that Elias must first come?" (Mt. 17: 10),--he simply replied: "Elias is come already but they knew him not"......"Then the disciples understood that he spake unto them of John the Baptist" (Mt. 17:11-13); because, as further explained, John the Baptist came "in the spirit and power of Elias" (LK. 1:17). The appearance of the Messiah among Muslims thus meant only the appearance of a mujaddid "in the spirit and power" of the Messiah.</P>
<P>The Messiah's work is thus described in the <I>Bukh&acirc;r&icirc;</I> "The son of Mary will appear among you as a judge, doing justice (between people), and he will break the Cross and kill the swine" (B. 60:49). This clearly shows that the Messiah would come when the religion of the Cross will be in the ascendant, and that his work will be to spread Isl&acirc;m among the Christian nations of the world in particular. which in other Had&icirc;th is described as the rising of the sun in the West, the sun standing for the Sun of Isl&acirc;m and the West for the Western nations. Thus this prophecy speaks in fact of the final ascendancy of Isl&acirc;m in the world.]</P>
</FONT><P>{p. 258}</P>
<P>". . . Then invite them to Isl&acirc;m, and inform them of what is incumbent on them; for, by All&acirc;h, if a single man is guided aright through thee, it is better for thee than red camels."[5]</P>
<P ALIGN="RIGHT">(B. 56:102.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>8</FONT></B> Ibn 'Abb&acirc;s reported,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, wrote to the C&aelig;sar inviting him to Isl&acirc;m, and sent his letter to him with Dihyah al-Kalb&icirc;, and the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, ordered him to make it over to the Chief of Busr&acirc; that he might send it to the Caesar.[6]</P>
<P ALIGN="RIGHT">(B. 56:102.)</P>
<FONT SIZE=2><P>[5. These instructions were given to 'Ali by the Holy Prophet in the expedition of Khaibar, which shows that invitation to Isl&acirc;m was the greatest jih&acirc;d of Muslims.</P>
<P>6. This Had&icirc;th which speaks of the Holy Prophet inviting the C&aelig;sar to Isl&acirc;m forms part of the chapter on Jihad in the Bukh&acirc;r&icirc;, which again shows the wide sense in which jih&acirc;d was interpreted by Muslims. The subject-matter of the letter written is produced in the next had&icirc;th, which should be treated as a supplement to this had&icirc;th.]</P>
</FONT><P>{p. 259}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>9</FONT></B> Ibn 'Abb&acirc;s reported,</P>
<P>. . . And this (letter) ran as follows:</P>
<P>"In the name of All&acirc;h, the Beneficent, the Merciful. From Muhammad, the servant of All&acirc;h and His Messenger, to Heraclius, the Chief of the Roman Empire. Peace be with him who follows the guidance. After this, I invite thee with invitation to Isl&acirc;m. Become a Muslim and thou wilt be in peace--All&acirc;h will give thee a double reward; but if thou turnest away, on thee will be the sin of thy subjects. And, O followers of the Book! Come to an equitable proposition between us and you that we shall not serve any but All&acirc;h, and that we shall not associate aught with Him, and that some of us shall not take others for lords besides All&acirc;h; but if they turn</P>
<P>{p. 260}</P>
<P>back, then say: Bear witness that we are Muslims."</P>
<P ALIGN="RIGHT">(B. 1:1.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>10</FONT></B> Salamah said,</P>
<P>I swore allegiance to the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, then I turned to the shade of a tree. When the crowd diminished, he (the Prophet) said, "O Ibn al-Akwa'! Will thou not swear allegiance?" He said, I said, I have already sworn allegiance, O Messenger of All&acirc;h! He said, "And do it again." So I swore allegiance to him a second time. I (the reporter) said to him, O Abu Muslim! For what did you swear allegiance (to him) then? He said, For death.[8]</P>
<P ALIGN="RIGHT">(B. 56:110.)</P>
<FONT SIZE=2><P>[7. B. 1:1 is a very long had&icirc;th, only the part relating to the letter spoken of in the last had&icirc;th is produced here. The subject-matter of the letter is a clear proof that invitation to Isl&acirc;m was not accompanied by any threat of hostilities. Similar letters were written to other rulers.</P>
<P>8 This happened at Hudaibiyah where the famous truce of that name was concluded. Swearing allegiance for death meant that a man would defend Isl&acirc;m and stand by the Holy Prophet even though he had to face death.]</P>
</FONT><P>{p. 261}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>11</FONT></B> Abd All&acirc;h ibn Ab&ucirc; Auf&acirc; reported,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>And know that paradise is beneath the protection of the swords."[9]</P>
<P ALIGN="RIGHT">(B. 56:22.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>12</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>I heard the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, say</P>
<P>"By Him in Whose hand is my soul, were it not that there are men among the believers who cannot bear to remain behind me--and I do not find that on which to carry them--I would not remain behind an army that fights in the way of All&acirc;h; and by Him in Whose hand is my soul. I love that I</P>
<FONT SIZE=2><P>[9. The word <I>zil&acirc;l</I> used in the had&icirc;th is plural of <I>zill</I> which generally means shadow, but it really means that which serves to protect a thing. The Had&icirc;th emphasizes a Muslim's duty to be always ready to fight for the defence of the Truth. Muslims could not use the sword otherwise than in defence (v. 5).]</P>
</FONT><P>{p. 262}</P>
<P>should be killed in the way of All&acirc;h then brought to life, then killed again then brought to life, then killed again then brought to life, then killed again."</P>
<P ALIGN="RIGHT">(B. 56:7.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>13</FONT></B> Ab&ucirc; Hurairah said,</P>
<P>The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>Whom do you count to be a martyr among you?" They said, O Messenger of All&acirc;h! Whoever is killed in the way of All&acirc;h is a martyr. He said:</P>
<P>"In that case the martyrs of my community shall be very few--he who is killed in the way of All&acirc;h is a martyr; he who dies a natural death in the way of All&acirc;h is a martyr; he who dies of the plague (in the way of All&acirc;h) is a martyr; he who dies of cholera (in the way of</P>
<P>{p. 263}</P>
<P>All&acirc;h) is a martyr."[10]</P>
<P ALIGN="RIGHT">(M-Msh. 18.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>14</FONT></B> Anas said,</P>
<P>On the day that battle was fought at Uhud, (some) people fled away from. the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>. He said, And I saw '&Acirc;'ishah, daughter of Abu Bakr and Umm Sulaim, and they had both tucked up their garments, so that I could see the anklets on their shanks, and they were carrying skins (full of water) on their backs, and they poured water into the mouths of the people then they went back and filled them again, then came and</P>
<FONT SIZE=2><P>[10. The Arabic word for martyr is <I>shah&icirc;d</I> which means a witness of truth. One who is killed in defence of the Faith is called a <I>shah&icirc;d</I> because he as it were sees the truth with his own eyes and lays down his life for it. This had&icirc;th shows further that every one who devotes his life to the service of the Truth is a <I>shah&icirc;d</I>, whether he is killed in a battle for the defence of Faith or dies a natural death or dies of plague or cholera.]</P>
</FONT><P>{p. 264}</P>
<P>poured them into the mouths of the people.[11]</P>
<P ALIGN="RIGHT">(B. 56:65.)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>15</FONT></B> Rubayyi' daughter of Mu'awwidh said,</P>
<P>We used to be with the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, (in his battles), giving drink to and tending the wounded, and removing the slain to Mad&icirc;nah.</P>
<P ALIGN="RIGHT">(B. 56:67)</P>
<P><B><FONT SIZE=5 COLOR=GREEN>16</FONT></B> 'Abd All&acirc;h reported,</P>
<P>A woman was found among the killed in one of the battles of the Prophet, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, so the Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, forbade the killing of women and children.'[12]</P>
<P ALIGN="RIGHT">(B. 56:147.)</P>
<FONT SIZE=2><P>[11. This shows that in the Holy Prophet's time women did the duty of nursing the wounded and helping the armies of Isl&acirc;m in all other possible ways. As the next had&icirc;th shows, they did the duty of carrying the slain to Mad&icirc;nah. In B. 56: 63, it is related that a woman, named Bint Milh&acirc;n, requested the Holy Prophet to pray for her to be among those who sailed on the seas to fight in the way of All&acirc;h.</P>
<P>12. Thus in the exigency of battles Isl&acirc;m did not allow the killing of non combatants. "Do not kill a woman, nor a labourer." "Do not kill an old man, nor a child, nor a woman", are the words of other had&icirc;th, (AD-Msh. 18:4).]</P>
</FONT><P>{p. 265}</P>
<P><B><FONT SIZE=5 COLOR=GREEN>17</FONT></B> Ibn 'Umar reported, The Messenger of All&acirc;h, <FONT SIZE=2 COLOR=GREEN>peace and blessings of All&acirc;h be on him</FONT>, said:</P>
<P>'I have been commanded that I should fight these people till they bear witness that there is no god but All&acirc;h and keep up prayer and pay zak&acirc;t. When they do this, their blood and their property shall be safe with me except as Isl&acirc;m requires, and their reckoning is with All&acirc;h."[13]</P>
<P ALIGN="RIGHT">(B. 2:16.)</P>
<FONT SIZE=2><P>[13. The had&icirc;th begins with the words, I have been commanded, and the command to fight is contained in the Holy Qur'&acirc;n in the following words: "And fight in the way of All&acirc;h with those who fight with you and do not exceed this limit" (v. 5). Muslims, therefore, could not resort to fighting unless an enemy was the first to assume hostilities. What the had&icirc;th means is that fighting begun under these conditions is to cease when the enemy people accept Isl&acirc;m. Bukh&acirc;r&icirc; himself hints at this when he quotes this had&icirc;th under the heading if they repent and keep up prayer and pay the poor-rate, then leave their way free," <I>i.e.</I>, cease fighting with them.]</P>
</FONT><P>{p. 266}</P>
<HR>
<CENTER>
<A HREF="had23.htm">Next: Chapter XX MARRIAGE</A></CENTER>
</BODY>
</HTML>
